Revit 2024 API
MacroModule.Environment Property
 The Macro environment.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MacroEnvironment Environment { get; }
Visual Basic
Public ReadOnly Property Environment As MacroEnvironment
	Get
Visual C++
public:
property MacroEnvironment Environment {
	MacroEnvironment get ();
}
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace